{
    "flashcards": [
      {
        "id": 1,
        "term": "Feminism",
        "definition": "An intellectual commitment and political movement towards ending oppression and achieving equality and respect for all."
      },
      {
        "id": 2,
        "term": "Sexism",
        "definition": "Discrimination based on one’s sex; an ideology that justifies and supports male-dominant social relations."
      },
      {
        "id": 3,
        "term": "Patriarchy",
        "definition": "A social system in which men hold primary power and predominate in roles of leadership, authority, and privilege."
      },
      {
        "id": 4,
        "term": "First Wave Feminism",
        "definition": "Focused on women’s suffrage, education, employment, and marriage laws; active from 1848-1914."
      },
      {
        "id": 5,
        "term": "Second Wave Feminism",
        "definition": "Centered on gender equality, reproductive rights, and ending discrimination in the workplace; active from the 1960s-1970s."
      },
      {
        "id": 6,
        "term": "Third Wave Feminism",
        "definition": "Emphasized intersectionality, gender fluidity, and inclusivity; active from the 1990s to today."
      },
      {
        "id": 7,
        "term": "Intersectionality",
        "definition": "A framework that examines how various social identities (race, gender, class, etc.) interact and contribute to oppression."
      },
      {
        "id": 8,
        "term": "Mary Wollstonecraft",
        "definition": "An early feminist philosopher who wrote 'A Vindication of the Rights of Woman,' advocating for women’s education."
      },
      {
        "id": 9,
        "term": "John Stuart Mill",
        "definition": "A philosopher who argued for gender equality in 'The Subjection of Women,' stating that inequality is based on custom rather than reason."
      },
      {
        "id": 10,
        "term": "Simone de Beauvoir",
        "definition": "Author of 'The Second Sex,' which introduced the concept of 'woman as other' and examined gender as a social construct."
      },
      {
        "id": 11,
        "term": "bell hooks",
        "definition": "A feminist theorist who emphasized race, class, and gender in feminist discourse, critiquing the exclusion of women of color."
      },
      {
        "id": 12,
        "term": "Radical Feminism",
        "definition": "A feminist perspective that views patriarchy as the root cause of women's oppression and seeks to dismantle it completely."
      },
      {
        "id": 13,
        "term": "Liberal Feminism",
        "definition": "A feminist approach that seeks to achieve gender equality through legal and social reform."
      },
      {
        "id": 14,
        "term": "Marxist Feminism",
        "definition": "A perspective that links women's oppression to capitalist exploitation and advocates for economic restructuring."
      },
      {
        "id": 15,
        "term": "Queer Theory",
        "definition": "A theoretical perspective that critiques fixed categories of gender and sexuality, emphasizing their fluid and constructed nature."
      },
      {
        "id": 16,
        "term": "Transgender Studies",
        "definition": "An academic field that examines issues related to transgender identities, challenging traditional notions of sex and gender."
      },
      {
        "id": 17,
        "term": "TERF (Trans-Exclusionary Radical Feminist)",
        "definition": "A term used to describe feminists who do not recognize transgender women as women and oppose trans inclusion in feminist movements."
      },
      {
        "id": 18,
        "term": "Theology vs. Philosophy of Religion",
        "definition": "Theology relies on religious doctrine, while the philosophy of religion uses analytic reasoning to examine religious beliefs."
      },
      {
        "id": 19,
        "term": "Ninian Smart’s Seven Dimensions of Religion",
        "definition": "A model identifying seven aspects of religion: ritual, emotional, narrative, doctrinal, ethical, social, and material."
      },
      {
        "id": 20,
        "term": "Misogyny",
        "definition": "Social systems and environments that enforce male dominance by punishing women who challenge it."
      },
      {
        "id": 21,
        "term": "Biological Determinism",
        "definition": "The belief that biological sex determines gender roles and abilities, often used to justify gender inequality."
      },
      {
        "id": 22,
        "term": "Essentialism",
        "definition": "The idea that certain traits are inherent and universal to a group, often criticized for ignoring individual and cultural differences."
      },
      {
        "id": 23,
        "term": "Social Constructionism",
        "definition": "The view that gender and other social categories are created through cultural and social practices rather than biology."
      },
      {
        "id": 24,
        "term": "Sex vs. Gender",
        "definition": "Sex refers to biological characteristics, while gender refers to social and cultural roles and identities."
      },
      {
        "id": 25,
        "term": "Gender Identity",
        "definition": "An individual's personal experience of their gender, which may or may not align with their assigned sex at birth."
      },
      {
        "id": 26,
        "term": "Reproductive Rights",
        "definition": "The legal and political rights related to contraception, abortion, and reproductive healthcare."
      },
      {
        "id": 27,
        "term": "Gender Pay Gap",
        "definition": "The difference in earnings between men and women, often attributed to systemic discrimination and occupational segregation."
      },
      {
        "id": 28,
        "term": "Glass Ceiling",
        "definition": "An invisible barrier preventing women from advancing to higher positions in the workplace."
      },
      {
        "id": 29,
        "term": "Suffrage Movement",
        "definition": "The fight for women's right to vote, which led to the passage of the 19th Amendment in the U.S. in 1920."
      },
      {
        "id": 30,
        "term": "Violence Against Women Act (1994)",
        "definition": "A U.S. law aimed at addressing and preventing domestic violence, sexual assault, and stalking."
      },
      {
        "id": 31,
        "term": "Pornification of Media",
        "definition": "The increasing sexualization of women in popular culture and advertising."
      },
      {
        "id": 32,
        "term": "Postmodern Feminism",
        "definition": "A feminist perspective that questions universal truths about gender and embraces fluidity in identity."
      },
      {
        "id": 33,
        "term": "Motherhood and Feminism",
        "definition": "Feminist debates on how motherhood is valued, the expectations placed on women, and policies supporting working mothers."
      },
      {
        "id": 34,
        "term": "Andrea Nye",
        "definition": "A philosopher who explored misogyny in philosophy and the historical exclusion of women from intellectual traditions."
      }
    ]
  }