{
    "flashcards": [
      {
        "id": 1,
        "term": "Ecofeminism",
        "definition": "A movement that connects environmental and feminist issues, arguing that the oppression of women and nature are linked."
      },
      {
        "id": 2,
        "term": "Gaard and Gruen on Ecofeminism",
        "definition": "Ecofeminists who argue that environmental destruction and social injustice are interconnected and must be addressed holistically."
      },
      {
        "id": 3,
        "term": "Holistic Approach in Ecofeminism",
        "definition": "Ecofeminism emphasizes an interconnected, multi-systems analysis of oppression, including racism, sexism, classism, and speciesism."
      },
      {
        "id": 4,
        "term": "Environmental Issues Addressed by Ecofeminism",
        "definition": "Overconsumption, deforestation, pollution, mass species extinction, and climate change."
      },
      {
        "id": 5,
        "term": "Patriarchy and Environmental Destruction",
        "definition": "Ecofeminists argue that patriarchal systems promote exploitation of both women and nature."
      },
      {
        "id": 6,
        "term": "Liberal Feminism vs. Ecofeminism",
        "definition": "Liberal feminism focuses on individual autonomy, while ecofeminism sees oppression as interconnected with environmental destruction."
      },
      {
        "id": 7,
        "term": "Socialist Feminism and Ecofeminism",
        "definition": "Socialist feminists critique capitalism’s role in environmental exploitation, which aligns with ecofeminist views."
      },
      {
        "id": 8,
        "term": "Third World and Ecofeminism",
        "definition": "Overconsumption in the Global North leads to environmental destruction and displacement in the Global South."
      },
      {
        "id": 9,
        "term": "Civil Disobedience",
        "definition": "The intentional breaking of unjust laws to protest injustice while accepting legal consequences."
      },
      {
        "id": 10,
        "term": "Key Figures in Civil Disobedience",
        "definition": "Socrates, St. Thomas Aquinas, John Locke, Henry David Thoreau, Mahatma Gandhi, Martin Luther King Jr."
      },
      {
        "id": 11,
        "term": "Historical Examples of Civil Disobedience",
        "definition": "Susan B. Anthony voting, Gandhi's protests, Rosa Parks refusing to sit at the back of the bus, MLK’s marches."
      },
      {
        "id": 12,
        "term": "Contemporary Examples of Civil Disobedience",
        "definition": "Occupy Wall Street, Standing Rock protests, ACT UP, tax resistance movements."
      },
      {
        "id": 13,
        "term": "Features of Civil Disobedience",
        "definition": "Must be conscientious, public, political, non-violent, and accompanied by an expectation of punishment."
      },
      {
        "id": 14,
        "term": "Justifications for Civil Disobedience",
        "definition": "Response to injustice, last resort, coordination with others, effectiveness, and minimal expected harm."
      },
      {
        "id": 15,
        "term": "Direct vs. Indirect Civil Disobedience",
        "definition": "Directly disobeys the unjust law vs. violating a different law to protest injustice."
      },
      {
        "id": 16,
        "term": "Theories of Punishment for Civil Disobedience",
        "definition": "Just deserts (proportional punishment), deterrence (severe punishment), and communicative (repentance)."
      },
      {
        "id": 17,
        "term": "John Rawls on Civil Disobedience",
        "definition": "Civil disobedience is justified when it protests substantial injustice in a nearly just society."
      },
      {
        "id": 18,
        "term": "Economic Justice",
        "definition": "The pursuit of fairness in economic policies, wealth distribution, and access to opportunities."
      },
      {
        "id": 19,
        "term": "Iris Marion Young on Economic Justice",
        "definition": "Argues for shifting from a focus on material goods to addressing power structures and institutional inequality."
      },
      {
        "id": 20,
        "term": "Distributive Paradigm",
        "definition": "A justice framework focusing on fair distribution of goods but criticized for ignoring power structures."
      },
      {
        "id": 21,
        "term": "Forms of Justice",
        "definition": "Retributive (punishment for wrongdoing), compensatory (correcting past harms), and distributive (fair distribution of resources)."
      },
      {
        "id": 22,
        "term": "Jonathan Wolff on Economic Competition",
        "definition": "Argues that economic competition harms losers, despite claims that it benefits society."
      },
      {
        "id": 23,
        "term": "Nozick’s View on Economic Justice",
        "definition": "Argues that economic competition does not harm individuals because participation is voluntary."
      },
      {
        "id": 24,
        "term": "Exploitation in Economic Systems",
        "definition": "Occurs when economic competition benefits winners at the expense of losers, particularly in the Global South."
      },
      {
        "id": 25,
        "term": "Consequences of Economic Competition",
        "definition": "Encourages inequality, social stratification, and economic vulnerability."
      },
      {
        "id": 26,
        "term": "John Stuart Mill on Competition",
        "definition": "Argued that competition fosters negative emotions like envy and hatred."
      },
      {
        "id": 27,
        "term": "The Good Life Argument",
        "definition": "Some argue that economic competition is not forced but freely chosen, though critics note social pressures make it inevitable."
      },
      {
        "id": 28,
        "term": "Economic Justice and Global Inequality",
        "definition": "First-world consumers benefit from cheaper goods at the expense of exploited third-world laborers."
      },
      {
        "id": 29,
        "term": "Alternative Approaches to Economic Justice",
        "definition": "Focus on power relations, providing opportunities rather than distributing material goods."
      },
      {
        "id": 30,
        "term": "Impact of Capitalism on Economic Justice",
        "definition": "Capitalism often prioritizes profit over fairness, leading to systemic economic exploitation."
      },
      {
        "id": 31,
        "term": "Ethical Theories and Economic Justice",
        "definition": "Utilitarianism supports competition if it maximizes well-being; deontology focuses on fairness and rights."
      },
      {
        "id": 32,
        "term": "Economic Safety Nets",
        "definition": "Policies that protect individuals from the harms of economic competition, such as minimum wage and healthcare."
      },
      {
        "id": 33,
        "term": "Consumer Responsibility in Economic Justice",
        "definition": "Consumers contribute to exploitation when prioritizing low-cost goods over ethical labor practices."
      },
      {
        "id": 34,
        "term": "Exploitation of Third-World Labor",
        "definition": "Low wages, poor working conditions, and lack of representation perpetuate economic injustice in developing nations."
      },
      {
        "id": 35,
        "term": "Race, Gender, and Economic Injustice",
        "definition": "Marginalized groups often face systemic barriers to economic opportunities due to discrimination."
      },
      {
        "id": 36,
        "term": "Global North vs. Global South",
        "definition": "Developed nations benefit from the labor and resources of developing nations, perpetuating economic disparities."
      },
      {
        "id": 37,
        "term": "Economic Policies and Civil Disobedience",
        "definition": "Movements like Occupy Wall Street protest economic inequality and corporate influence in politics."
      }
    ]
  }